In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1': np.random.randn(5),
                   'data2': np.random.randn(5)})

In [5]:
df

  key1 key2     data1     data2
0    a  one -0.228428  1.308762
1    a  two  0.653752  0.842625
2    b  one  0.468158 -0.707631
3    b  two -0.058847 -0.264133
4    a  one  0.629282  1.242840

In [7]:
grouped = df['data1'].groupby(df['key1'])

In [8]:
grouped

In [9]:
grouped.mean()

key1
a    0.351535
b    0.204655
Name: data1, dtype: float64

In [10]:
#df.groupby?

In [11]:
means = df['data1'].groupby([ df['key1'], df['key2'] ]).mean()

In [12]:
means

key1  key2
a     one     0.200427
      two     0.653752
b     one     0.468158
      two    -0.058847
Name: data1, dtype: float64

In [13]:
df

  key1 key2     data1     data2
0    a  one -0.228428  1.308762
1    a  two  0.653752  0.842625
2    b  one  0.468158 -0.707631
3    b  two -0.058847 -0.264133
4    a  one  0.629282  1.242840

In [14]:
means.unstack()

key2       one       two
key1
a     0.200427  0.653752
b     0.468158 -0.058847

In [15]:
means.unstack(0)

key1         a         b
key2
one   0.200427  0.468158
two   0.653752 -0.058847

In [16]:
means.unstack(1)

key2       one       two
key1
a     0.200427  0.653752
b     0.468158 -0.058847

In [17]:
df.groupby('key1').sum()

         data1     data2
key1
a     1.054606  3.394226
b     0.409311 -0.971764

In [18]:
df.groupby(['key1','key2']).sum()

              data1     data2
key1 key2
a    one   0.400854  2.551601
     two   0.653752  0.842625
b    one   0.468158 -0.707631
     two  -0.058847 -0.264133

In [19]:
grouped = df.groupby('key1')

In [20]:
grouped

In [21]:
for name, group in grouped:
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.228428  1.308762
1    a  two  0.653752  0.842625
4    a  one  0.629282  1.242840
b
  key1 key2     data1     data2
2    b  one  0.468158 -0.707631
3    b  two -0.058847 -0.264133

In [22]:
df2 = pd.DataFrame(np.random.randn(5, 5), 
                   columns=['a', 'b', 'c', 'd', 'e'],
                   index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [23]:
df2

               a         b         c         d         e
Joe    -1.409889 -0.242527 -0.759591  0.070069 -1.853484
Steve  -0.952973  0.173028  0.666525 -1.626517 -0.636859
Wes     0.354091 -0.196525 -0.657570  0.906996  1.073435
Jim     0.113083 -2.705696 -0.433732  0.527411 -0.116274
Travis  1.823634 -0.385438  0.269019  1.504187 -0.915509

In [24]:
map_dict = {'a':'red', 'b':'red', 'c':'blue', 'd':'blue','e':'red', 'f':'gold'}

In [25]:
df2.groupby(map_dict, axis=1).sum()

            blue       red
Joe    -0.689522 -3.505900
Steve  -0.959992 -1.416804
Wes     0.249425  1.231001
Jim     0.093679 -2.708887
Travis  1.773206  0.522687